load-test.yml
config:
  target: "http://localhost:3000"
  phases:
  - duration: 300 # Shorter initial phase
    arrivalRate: 10  # Reduced to stay within rate limits
  # - duration: 60
  #   arrivalRate: 8   # Reduced to stay within rate limits

scenarios:
  - name: "Task Submission Test"
    flow:
      - post:
          url: "/api/tasks"
          json:
            type: "load_test"
            data: "payload-{{ $timestamp }}"
          headers:
            Content-Type: "application/json"